# Пользователь вводит список имён одной строкой, разделяя их пробелами. Приведите
# список к корректному формату и выведите его на экран в алфавитном порядке.
# Корректным считается имя, которое начинается с заглавной буквы, а все остальные
# буквы - строчные. Если имя содержит любые символы, кроме букв, оно удаляется
# из списка.
#
# Пример данных:
# "иван ОЛЕГ Анна Анат0лий МариЯ r2d2"


def normalize_names(line: str) -> list[str]:
    return sorted(map(str.capitalize, filter(str.isalpha, line.split())))


if __name__ == "__main__":
    print(*normalize_names(input("Введите имена через пробел: ")))
