# Дан список возрастов группы людей в формате "15 лет", "51 год", "52 года" и т.д.
# Вычислите минимальный, максимальный и средний возраста группы и выведите их
# на экран.
#
# Пример данных:
# ["10 лет", "60 лет", "45 лет", "31 год", "34 года", "88 лет", "3 года", "21 год"]

ages = ["10 лет", "60 лет", "45 лет", "31 год", "34 года", "88 лет", "3 года", "21 год"]
numbers = [int(age.split()[0]) for age in ages]

print(f"Минимальный: {min(numbers)}")
print(f"Максимальный: {max(numbers)}")
print(f"Средний: {sum(numbers) / len(numbers):.2f}")
